Belief997/lab-Micro_power_consumption_backscatter/SDK_2.3.1_MKL03Z32xxx4/boards/frdmkl03z/demo_apps/power_mode_switch/power_mode_switch.c
        /* If RX is idle and g_rxBuffer is empty, start to read data to g_rxBuffer. */
        if ((!rxOnGoing) && rxBufferEmpty)
        {
            rxOnGoing = true;
            LPUART_TransferReceiveNonBlocking(DEMO_LPUART, &g_lpuartHandle, &receiveXfer, &receivedBytes);
            if (ECHO_BUFFER_SIZE == receivedBytes)
            {
                rxBufferEmpty = false;
                rxOnGoing = false;
            }
            memcpy(uart_rx + cnt_rx, g_rxBuffer, 1);
            cnt_rx++;

        }

        if(cnt_uart_sample ++ >= 100)
        {

        	if(cnt_rx == cnt_rx_last && cnt_rx != 0)
            {
        		if(0)
        		{

        		}

            }
        	cnt_rx_last = cnt_rx;
        }


        /* If TX is idle and g_txBuffer is full, start to send data. */
        if ((!txOnGoing) && txBufferFull)
        {
            txOnGoing = true;
            LPUART_TransferSendNonBlocking(DEMO_LPUART, &g_lpuartHandle, &sendXfer);
        }

        /* Delay some time, simulate the app is processing other things, input data save to ring buffer. */
        i = 0x10U;
        while (i--)
        {
            __NOP();
        }
    }


#endif


#ifdef DEBUG_END


/*******************************************************************************
 *
 *  pwm init
 *
 *  *******************************************************************************/
//     tpm config init
#ifndef TPM_LED_ON_LEVEL
#define TPM_LED_ON_LEVEL kTPM_LowTrue
#endif
#if USER_PWM_NUM == 1
    tpm_config_t tpmInfo;
    tpm_chnl_pwm_signal_param_t tpmParam;

    tpmParam.chnlNumber = (tpm_chnl_t)BOARD_TPM_CHANNEL;
    tpmParam.level = TPM_LED_ON_LEVEL;
    tpmParam.dutyCyclePercent = updatedDutycycle;

#elif USER_PWM_NUM == 2
    tpm_config_t tpmInfo;
    tpm_chnl_pwm_signal_param_t tpmParam[2];

#ifndef TPM_LED_ON_LEVEL
      #define TPM_LED_ON_LEVEL kTPM_LowTrue
#endif
#define BOARD_FIRST_TPM_CHANNEL 0U
#define BOARD_SECOND_TPM_CHANNEL 1U

    tpmParam[0].chnlNumber = (tpm_chnl_t)BOARD_FIRST_TPM_CHANNEL;
    tpmParam[0].level = TPM_LED_ON_LEVEL;
    tpmParam[0].dutyCyclePercent = updatedDutycycle;

    tpmParam[1].chnlNumber = (tpm_chnl_t)BOARD_SECOND_TPM_CHANNEL;
    tpmParam[1].level = TPM_LED_ON_LEVEL;
    tpmParam[1].dutyCyclePercent = updatedDutycycle;

#else
    #error "pwm num set err!"
#endif

/******************************************************************************/

    /* Define the init structure for the output ENABLE pin*/
    gpio_pin_config_t enable_config = {
        kGPIO_DigitalOutput, 0,
    };
    BOARD_InitPins();

    /* Init output ENABLE GPIO. */
    GPIO_PinInit(GPIOA, 7U, &enable_config);

    // api to write gpio value
//    GPIO_WritePinOutput(GPIOA, 7U, 1);
//    GPIO_WritePinOutput(GPIOA, 7U, 0);

    BOARD_BootClockRUN();
    APP_InitDefaultDebugConsole();

    NVIC_EnableIRQ(LLWU_IRQn);
    NVIC_EnableIRQ(APP_WAKEUP_BUTTON_IRQ);

    if (kRCM_SourceWakeup & RCM_GetPreviousResetSources(RCM)) /* Wakeup from VLLS. */
    {
        PRINTF("\r\nMCU wakeup from VLLS modes...\r\n");
    }

/*******************************************************************************
 *
 *  adc & lptmr init
 *
 *  *******************************************************************************/
    // ptb3 init gpio
    LED1_INIT();
//	GPIO_WritePinOutput(GPIOB, 3U, 1);
//	GPIO_WritePinOutput(GPIOB, 3U, 0);

    /* Calibrate param Temperature sensor */
//    ADC16_CalibrateParams(DEMO_ADC16_BASEADDR);

    /* Initialize ADC */
//  if (!ADC16_InitHardwareTrigger(DEMO_ADC16_BASEADDR))
//  {
//      PRINTF("Failed to do the ADC init\r\n");
//      return -1;
//  }
    LPTMR_InitTriggerSourceOfAdc(DEMO_LPTMR_BASE);
//    NVIC_EnableIRQ(DEMO_ADC16_IRQ_ID);


    // debug timer test
    /* Enable timer interrupt */
    LPTMR_EnableInterrupts(DEMO_LPTMR_BASE, kLPTMR_TimerInterruptEnable);

    /* Enable at the NVIC */
    EnableIRQ(DEMO_LPTMR_IRQn);
    LPTMR_StartTimer(DEMO_LPTMR_BASE);

    while(1);
/******************************************************************************/
    // debug
//    while (0)
    {
        curPowerState = SMC_GetPowerModeState(SMC);

//        APP_ShowPowerMode(curPowerState);
//        user_showFreqList();

        // set default powermode as vlpr
        if(curPowerState != kSMC_PowerStateVlpr)
        {
			targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
        }
        else
        {
        		targetPowerMode = (app_power_mode_t)kAPP_PowerModeVlpr;
        }
        // A:run, D:vlpr, I:vlls3
//        PRINTF("\r\nTarget %c \r\n", targetPowerMode);

		if ((targetPowerMode > kAPP_PowerModeMin) && (targetPowerMode < kAPP_PowerModeMax))
		{
			/* If could not set the target power mode, loop continue. */
			if (!APP_CheckPowerMode(curPowerState, targetPowerMode))
			{
//				PRINTF("\r\n curPowerState %x \r\n", curPowerState);
//				continue;
//				break;
			}

			/* If target mode is RUN/VLPR/HSRUN, don't need to set wakeup source. */
			if ((kAPP_PowerModeRun == targetPowerMode) || (kAPP_PowerModeVlpr == targetPowerMode))
			{
				needSetWakeup = false;
			}

			else
			{
				needSetWakeup = true;
			}

			if (needSetWakeup)
			{
				APP_GetWakeupConfig(targetPowerMode);
			}

			APP_PowerPreSwitchHook(curPowerState, targetPowerMode);

			if (needSetWakeup)
			{
				APP_SetWakeupConfig(targetPowerMode);
			}

			APP_PowerModeSwitch(curPowerState, targetPowerMode);
			APP_PowerPostSwitchHook(curPowerState, targetPowerMode);
		}

    };

    // debug: show state to check
//    {
//        curPowerState = SMC_GetPowerModeState(SMC);
//        freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
//        APP_ShowPowerMode(curPowerState);

//    	  user_showFreqList();
//    }

/*******************************************************************************
 *
 *  init and run pwm here
 *
 *  *******************************************************************************/
    /* Select the clock source for the TPM counter as kCLOCK_McgInternalRefClk */
//    CLOCK_SetTpmClock(1U);
    CLOCK_SetTpmClock(3U);

    TPM_GetDefaultConfig(&tpmInfo);
    /* Initialize TPM module */
    TPM_Init(BOARD_TPM_BASEADDR, &tpmInfo);

    // redefine ch number by micro, set freq divider here
    TPM_SetupPwm(BOARD_TPM_BASEADDR, &tpmParam, USER_PWM_NUM, kTPM_CenterAlignedPwm, 500000U, 2000000); //  2M clock source @VLPR
    TPM_StartTimer(BOARD_TPM_BASEADDR, kTPM_SystemClock);

/******************************************************************************/

    // debug
//    user_showFreqList();

